export default [
  {
    imgUrl: "choco-desert.png",
    title: "Шоколадный десерт с овсянкой",
    subtitle:
      "Две мясных котлеты гриль, Специальный соус, сыр, Огурцы, салат и лук, Огурцы, салат и лук. Всё на булачке с кунжутом,",
    price: 165,
  },
  {
    imgUrl: "fruit-desert.png",
    title: "Блинчики в малиной",
    subtitle:
      "Две мясных котлеты гриль, Специальный соус, сыр, Огурцы, салат и лук, Огурцы, салат и лук. Всё на булачке с кунжутом,",
    price: 100,
  },
  {
    imgUrl: "fruit-plombir.png",
    title: "Ягодный пломбир ",
    subtitle:
      "Две мясных котлеты гриль, Специальный соус, сыр, Огурцы, салат и лук, Огурцы, салат и лук. Всё на булачке с кунжутом,",
    price: 150,
  },
  {
    imgUrl: "fruit-cream.png",
    title: "Крем с ягодами",
    subtitle:
      "Две мясных котлеты гриль, Специальный соус, сыр, Огурцы, салат и лук, Огурцы, салат и лук. Всё на булачке с кунжутом,",
    price: 125,
  },
  {
    imgUrl: "choco-fruit.png",
    title: "Шоколад с ягодами",
    subtitle:
      "Две мясных котлеты гриль, Специальный соус, сыр, Огурцы, салат и лук, Огурцы, салат и лук. Всё на булачке с кунжутом,",
    price: 180,
  },
  {
    imgUrl: "frutty-pie.png",
    title: "Пирог с ягодами",
    subtitle:
      "Две мясных котлеты гриль, Специальный соус, сыр, Огурцы, салат и лук, Огурцы, салат и лук. Всё на булачке с кунжутом,",
    price: 135,
  },
];
