<template>
  <div class="navbar">
    <v-container>
      <div class="wrapper">
        <div class="wrapper-burger" @click="$emit('isOpen')">
          <div class="burger"></div>
          <div class="burger"></div>
          <div class="burger"></div>
          <div class="burger"></div>
        </div>
        <div class="wrapper-logo" @click="$router.push('/')">
          <div class="logo">
            <svg
              width="31"
              height="30"
              viewBox="0 0 31 30"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <g clip-path="url(#clip0_19:232)">
                <path
                  d="M21.202 10.2062H9.79801C4.38688 10.2062 0 14.6358 0 20.1021C0 25.5684 4.38688 30 9.79801 30H21.202C26.6131 30 31 25.5684 31 20.1021C31 14.6358 26.6131 10.2062 21.202 10.2062ZM20.9884 28.8651C16.199 28.8651 12.3157 24.9422 12.3157 20.1041C12.3157 15.2659 16.199 11.343 20.9884 11.343C25.7777 11.343 29.661 15.2659 29.661 20.1041C29.661 24.9422 25.7777 28.8651 20.9884 28.8651Z"
                  fill="#34C759"
                />
                <path
                  d="M19.8459 5.85553C19.8459 7.10215 20.1663 8.27171 20.729 9.2852C17.9939 8.80928 15.9129 6.40081 15.9129 3.501C15.9129 3.13684 15.9454 2.78038 16.0102 2.43356C16.5443 2.26978 17.1127 2.18115 17.7001 2.18115C18.711 2.18115 19.6628 2.44319 20.4906 2.90177C20.0767 3.79965 19.8459 4.79965 19.8459 5.85553Z"
                  fill="#34C759"
                />
                <path
                  d="M27.5363 3.50096C27.5363 6.15029 25.8006 8.38921 23.4145 9.11946C23.0044 9.2447 22.5772 9.32755 22.1328 9.35645H22.1309C21.4118 8.37958 20.9865 7.16763 20.9865 5.85549C20.9865 5.04239 21.1505 4.26782 21.4461 3.56262C22.2796 1.57803 24.1622 0.154143 26.3919 0C27.1109 0.976879 27.5363 2.18882 27.5363 3.50096Z"
                  fill="#34C759"
                />
              </g>
              <defs>
                <clipPath id="clip0_19:232">
                  <rect width="31" height="30" fill="white" />
                </clipPath>
              </defs>
            </svg>
          </div>
          <h4>Территория вкуса</h4>
        </div>
        <div class="profile-items">
          <svg
            width="20"
            height="20"
            viewBox="0 0 20 20"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M18.6009 15.8428C18.1327 14.7531 17.4532 13.7632 16.6002 12.9284C15.7499 12.0912 14.7426 11.4236 13.6339 10.9627C13.624 10.9578 13.6141 10.9554 13.6042 10.9505C15.1506 9.853 16.1559 8.06531 16.1559 6.04837C16.1559 2.70714 13.4006 0 9.99993 0C6.59924 0 3.84394 2.70714 3.84394 6.04837C3.84394 8.06531 4.84925 9.853 6.3957 10.9529C6.38577 10.9578 6.37584 10.9602 6.36591 10.9651C5.25386 11.4261 4.256 12.087 3.39962 12.9308C2.54748 13.7663 1.86808 14.756 1.39892 15.8453C0.938023 16.9117 0.689449 18.055 0.666658 19.2133C0.665995 19.2394 0.670642 19.2653 0.680324 19.2895C0.690007 19.3137 0.704529 19.3358 0.723035 19.3545C0.741542 19.3731 0.763658 19.3879 0.78808 19.398C0.812502 19.4081 0.838737 19.4133 0.865238 19.4133H2.35459C2.46381 19.4133 2.55069 19.328 2.55317 19.2231C2.60282 17.3403 3.37231 15.577 4.73259 14.2405C6.14003 12.8577 8.00916 12.0967 9.99993 12.0967C11.9907 12.0967 13.8598 12.8577 15.2673 14.2405C16.6275 15.577 17.397 17.3403 17.4467 19.2231C17.4492 19.3304 17.536 19.4133 17.6453 19.4133H19.1346C19.1611 19.4133 19.1874 19.4081 19.2118 19.398C19.2362 19.3879 19.2583 19.3731 19.2768 19.3545C19.2953 19.3358 19.3099 19.3137 19.3195 19.2895C19.3292 19.2653 19.3339 19.2394 19.3332 19.2133C19.3084 18.0476 19.0626 16.9135 18.6009 15.8428V15.8428ZM9.99993 10.2432C8.86058 10.2432 7.78824 9.80666 6.98151 9.01403C6.17478 8.2214 5.73045 7.16781 5.73045 6.04837C5.73045 4.92894 6.17478 3.87535 6.98151 3.08272C7.78824 2.29009 8.86058 1.85353 9.99993 1.85353C11.1393 1.85353 12.2116 2.29009 13.0183 3.08272C13.8251 3.87535 14.2694 4.92894 14.2694 6.04837C14.2694 7.16781 13.8251 8.2214 13.0183 9.01403C12.2116 9.80666 11.1393 10.2432 9.99993 10.2432Z"
              fill="white"
            />
          </svg>
          <svg
            width="25"
            height="19"
            viewBox="0 0 25 19"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M24.1054 2.88003C24.0332 2.79087 23.9422 2.71884 23.8389 2.66912C23.7357 2.6194 23.6227 2.59322 23.5081 2.59246H7.35908L7.86325 4.14689H22.492L20.421 13.4735H8.78628L5.24156 2.22717C5.20321 2.10783 5.13663 1.99956 5.04749 1.91159C4.95835 1.82362 4.84929 1.75857 4.72963 1.72198L1.54946 0.742685C1.45168 0.712576 1.34893 0.702061 1.24709 0.71174C1.14525 0.721419 1.04631 0.751102 0.955915 0.799096C0.773359 0.896024 0.636707 1.06165 0.576021 1.25953C0.515335 1.45742 0.535586 1.67135 0.632319 1.85428C0.729052 2.0372 0.894342 2.17413 1.09183 2.23494L3.87641 3.08987L7.43665 14.3595L6.16458 15.401L6.06374 15.502C5.74909 15.8653 5.57074 16.3273 5.55942 16.8082C5.54809 17.2891 5.7045 17.7589 6.00169 18.1368C6.2131 18.3944 6.48175 18.5988 6.78614 18.7338C7.09053 18.8688 7.42221 18.9305 7.75466 18.914H20.7003C20.906 18.914 21.1033 18.8321 21.2487 18.6863C21.3942 18.5406 21.4759 18.3429 21.4759 18.1368C21.4759 17.9306 21.3942 17.7329 21.2487 17.5872C21.1033 17.4414 20.906 17.3595 20.7003 17.3595H7.63056C7.54124 17.3565 7.45422 17.3304 7.3779 17.2838C7.30158 17.2372 7.23854 17.1717 7.19487 17.0935C7.1512 17.0154 7.12838 16.9273 7.12862 16.8378C7.12885 16.7482 7.15212 16.6602 7.19619 16.5823L9.06551 15.0279H21.0415C21.2208 15.0323 21.3961 14.9743 21.5375 14.8637C21.679 14.7532 21.7778 14.597 21.8172 14.4217L24.276 3.54066C24.2996 3.42479 24.2965 3.30506 24.2669 3.19057C24.2373 3.07609 24.1821 2.96988 24.1054 2.88003V2.88003Z"
              fill="white"
            />
          </svg>
        </div>
        <div class="wrapper-menu">
          <div class="menu" v-for="(m, i) in menu" :key="i">
            <h5>{{ m.text }}</h5>
          </div>
        </div>
      </div>
    </v-container>
  </div>
</template>

<script>
export default {
  name: "Navbar",

  data() {
    return {
      menu: [
        { text: "Пицца" },
        { text: "Роллы" },
        { text: "Бизнес-ланчи" },
        { text: "Закуски" },
        { text: "Десерты" },
        { text: "Напитки" },
      ],
    };
  },
  methods: {},
};
</script>

<style lang="scss" scoped>
.navbar {
  background: #252525;
  opacity: 0.75;
  border-radius: 6px;
  padding: 40px 0;
  position: relative;
  z-index: 2;

  .silde-toggler {
    width: 45px;
    height: 45px;

    img {
      width: 100%;
      height: 100%;
    }
  }
  .wrapper-burger {
    display: flex;
    flex-direction: column;
    display: none;
    .burger {
      width: 32px;
      height: 2px;
      background: #ffffff;
      margin-bottom: 5px;
    }
  }
  .profile-items {
    display: none;
  }

  .wrapper {
    display: flex;
    align-items: center;
    justify-content: space-between;

    &-logo {
      display: flex;
      align-items: center;
      cursor: pointer;
      h4 {
        font-family: Alegreya;
        font-weight: bold;
        font-size: 24px;
        line-height: 14px;
        text-transform: uppercase;
        color: #34c759;
      }
    }
    &-menu {
      display: flex;
      align-items: center;

      h5 {
        margin-right: 20px;
        font-family: Alegreya;
        font-weight: 500;
        font-size: 14px;
        line-height: 14px;
        cursor: pointer;
        color: #ffffff;
        &:hover {
          color: #34c759;
        }
      }
    }
  }
}

@media screen and (max-width: 991.98px) {
  .navbar {
    .wrapper {
      display: flex;
      justify-content: space-between;
      align-items: center;
      .wrapper-logo {
        display: flex;
        justify-content: center;
        align-items: center;
      }
      .wrapper-menu {
        display: none;
      }
    }
    .wrapper-burger {
      display: block;
    }
    .profile-items {
      display: block;
    }
  }
}

@media screen and (max-width: 767.98px) {
  .navbar {
    .wrapper {
      display: flex;
      justify-content: space-between;
      align-items: center;
      .wrapper-logo {
        display: flex;
        justify-content: center;
        align-items: center;
      }
      .wrapper-menu {
        display: none;
      }
    }
    .wrapper-burger {
      display: block;
    }
    .profile-items {
      display: block;
    }
  }
}
</style>
